use db68

1.
SELECT йыдийос, ажл, епымулиа, одос, аяихлос, покг, тй, тгкежымо 
FROM пекатес

2.
SELECT йыдийос, глеяолгмиа, ыяа, посо
FROM сувмои_пекатес, пкгяылг
WHERE йыдийос=пекатгс AND глеяолгмиа > '2022-05-12' AND глеяолгмиа<'2022-05-22'

3.
SELECT йыдийос, глеяолгмиа_пая, пяозом
FROM паяаццекиес, пеяиеволемо_паяаццекиас AS пея
WHERE пея.паяаццекиа=паяаццекиес.йыдийос
GROUP BY пяозом,глеяолгмиа_пая, йыдийос

4.
UPDATE пяозом
SET тилг=тилг*1.03

5.
SELECT SUM(посо)AS сумоко_пкгяылым, AVG(посо) AS ло_пкгяылым, MONTH(глеяолгмиа) AS лгмас
FROM пкгяылг 
WHERE глеяолгмиа>='2022-01-01' AND глеяолгмиа<='2022-12-31'
GROUP BY DATEPART(MONTH, глеяолгмиа)

6.
SELECT пекатес.ажл, пекатес.епымулиа
FROM пекатес, паяаццекиес, пяозом, пеяиеволемо_паяаццекиас
WHERE пекатес.йыдийос = паяаццекиес.пекатгс
 AND пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос
  AND пеяиеволемо_паяаццекиас.пяозом = пяозом.йыдийос
  AND паяаццекиес.глеяолгмиа_пая BETWEEN '2023-01-01' AND '2023-01-31'
GROUP BY пекатес.ажл, пекатес.епымулиа
HAVING SUM(пеяиеволемо_паяаццекиас.посотгта * пяозом.тилг) > 2500;

7.
SELECT пекатес.йыдийос, йатгцояиа.титкос, SUM(пяозом.тилг * пеяиеволемо_паяаццекиас.посотгта) AS сумоко_аниас
FROM пекатес, паяаццекиес, пяозом, йатгцояиа, пеяиеволемо_паяаццекиас
WHERE пекатес.йыдийос = паяаццекиес.пекатгс
AND паяаццекиес.йыдийос = пеяиеволемо_паяаццекиас.паяаццекиа
AND пеяиеволемо_паяаццекиас.пяозом = пяозом.йыдийос
AND пяозом.йатгцояиа = йатгцояиа.йыдийос
GROUP BY пекатес.йыдийос, йатгцояиа.титкос;

8. 
SELECT 
    пеяиовг.омоласиа AS цеыцяажийг_пеяиовг,
    йатгцояиа.титкос AS йатгцояиа,
    AVG(пеяиеволемо_паяаццекиас.посотгта*пяозом.йыдийос) AS лесос_ояос_пыкгсеым
FROM 
    паяаццекиес, пеяиеволемо_паяаццекиас, пяозом, йатгцояиа, пеяиовг, пекатес
WHERE пеяиеволемо_паяаццекиас.пяозом = пяозом.йыдийос AND
пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос AND
пяозом.йатгцояиа = йатгцояиа.йыдийос AND
 пекатес.пеяиовг = пеяиовг.йыдийос
GROUP BY 
    пеяиовг.омоласиа,
    йатгцояиа.титкос;


9.

CREATE VIEW V1 AS (
SELECT SUM(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) AS SUM_V1
FROM пеяиеволемо_паяаццекиас, паяаццекиес, пяозом
WHERE DATEPART(YEAR,глеяолгмиа_пая)='2022' AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос AND паяаццекиес.йыдийос=пеяиеволемо_паяаццекиас.паяаццекиа)

SELECT DATEPART(MONTH,глеяолгмиа_пая) AS лгмас, cast(SUM(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) as float)/cast(SUM_V1 as float)  AS пыкгсеис_лгма_ыс_пососто_пыкгсеым_тоу_2022
FROM пеяиеволемо_паяаццекиас, паяаццекиес, V1, пяозом
WHERE DATEPART(YEAR,глеяолгмиа_пая)='2022' AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос AND паяаццекиес.йыдийос=пеяиеволемо_паяаццекиас.паяаццекиа
GROUP BY DATEPART(MONTH,глеяолгмиа_пая), SUM_V1

10. 
CREATE VIEW V2 AS
SELECT DATEPART(MONTH, глеяолгмиа_пая) AS лгмас, DATEPART(YEAR, глеяолгмиа_пая) AS вяомос, AVG(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) AS ло
FROM пеяиеволемо_паяаццекиас, паяаццекиес, пяозом
WHERE пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос
GROUP BY DATEPART(MONTH, глеяолгмиа_пая), DATEPART(YEAR, глеяолгмиа_пая)

CREATE VIEW V3 AS
SELECT DATEPART(MONTH, глеяолгмиа_пая) AS лгмас, DATEPART(YEAR, глеяолгмиа_пая) AS вяомос, AVG(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) AS ло_пекатг, паяаццекиес. пекатгс
FROM  пеяиеволемо_паяаццекиас, паяаццекиес, пяозом
WHERE пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос
GROUP BY DATEPART(MONTH, глеяолгмиа_пая), DATEPART(YEAR, глеяолгмиа_пая), паяаццекиес.пекатгс

SELECT V2.лгмас, V2.вяомос, COUNT(пекатгс) AS пкгхос_пекатым
FROM V2,V3
WHERE V2.лгмас=V3.лгмас AND V2.вяомос=V3.вяомос AND ло<ло_пекатг
GROUP BY V2.лгмас, V2.вяомос

11. 
CREATE VIEW V4 AS
SELECT DATEPART(MONTH, глеяолгмиа_пая) AS лгмас22, SUM(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) AS ахя22
FROM пеяиеволемо_паяаццекиас, паяаццекиес, пяозом
WHERE DATEPART(YEAR,глеяолгмиа_пая)='2022' AND пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос
GROUP BY DATEPART(MONTH, глеяолгмиа_пая)

CREATE VIEW V5 AS
SELECT DATEPART(MONTH, глеяолгмиа_пая) AS лгмас21, SUM(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг) AS ахя21
FROM пеяиеволемо_паяаццекиас, паяаццекиес, пяозом
WHERE DATEPART(YEAR,глеяолгмиа_пая)='2021' AND пеяиеволемо_паяаццекиас.паяаццекиа=паяаццекиес.йыдийос AND пеяиеволемо_паяаццекиас.пяозом=пяозом.йыдийос
GROUP BY DATEPART(MONTH, глеяолгмиа_пая)

SELECT V4.лгмас22 AS лгмас, FORMAT((CAST(ахя22 AS FLOAT)/CAST(ахя21 AS FLOAT)) *100, '0.##') + '%'  AS пыкгсеис_22_ыс_пососто_пыкгсеым_21
FROM V4,V5
WHERE лгмас22=лгмас21
ORDER BY лгмас22

12.
CREATE VIEW асй12 AS
SELECT DATEPART(MONTH,глеяолгмиа_пая) AS лгмас, CAST(AVG(пеяиеволемо_паяаццекиас.посотгта*пяозом.тилг)AS DECIMAL(10,2)) AS ло
FROM пяозом, пеяиеволемо_паяаццекиас, паяаццекиес
WHERE DATEPART(YEAR,глеяолгмиа_пая)='2022' AND пяозом.йыдийос=пеяиеволемо_паяаццекиас.пяозом AND паяаццекиес.йыдийос=пеяиеволемо_паяаццекиас.паяаццекиа
GROUP BY DATEPART(MONTH,глеяолгмиа_пая)

SELECT в.лгмас, в.ло AS ло_лгма, ь.ло AS ло_пяогцоулемым_лгмым
FROM асй12 AS в, асй12 AS ь
WHERE в.лгмас>=ь.лгмас AND (в.ло<>ь.ло OR в.лгмас='1')
ORDER BY в.лгмас ASC

13. 
SELECT DISTINCT пяозом.йыдийос, пеяиовг.омоласиа
FROM пяозом, пеяиовг, пяолгхеутгс, ацояа
WHERE пяозом.йыдийос=ацояа.пяозом AND ацояа.пяолгхеутгс=пяолгхеутгс.йыдийос AND пяолгхеутгс.пеяиовг=пеяиовг.йыдийос
GROUP BY пяозом.йыдийос, пеяиовг.омоласиа


14) 
CREATE TABLE пяолгхеутес_пяозомта (
пяолгхеутгс VARCHAR(20) FOREIGN KEY REFERENCES пяолгхеутгс,
епымулиа_пяол VARCHAR(30),
пяозом VARCHAR(20) FOREIGN KEY REFERENCES пяозом ,
омоласиа_пяозомтос VARCHAR(30))

SELECT паяаццекиес.йыдийос
FROM паяаццекиес, пяолгхеутес_пяозомта, пеяиеволемо_паяаццекиас, пяозом
WHERE паяаццекиес.йыдийос = пеяиеволемо_паяаццекиас.паяаццекиа AND пеяиеволемо_паяаццекиас.пяозом=пяолгхеутес_пяозомта.пяозом
AND пеяиеволемо_паяаццекиас.пяозом = пяозом.йыдийос
GROUP BY паяаццекиес.йыдийос
HAVING COUNT(DISTINCT пяолгхеутес_пяозомта.пяолгхеутгс) >= 5;
